app/controllers/comments_controller.rb

  def create
    @comment = Comment.new(comment_params)
    movie_id = @comment.movie_id
    @movie = Movie.find(movie_id)

    if @comment.save
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "comments" ("user_name", "body", "movie_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_name", "dee"], ["body", "rtbwčb"], ["movie_id", 1], ["created_at", "2019-09-15 18:39:25.559269"], ["updated_at", "2019-09-15 18:39:25.559269"]]

  def update
    movie_id = @comment.movie_id
    @movie = Movie.find(movie_id)
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def destroy
    @comment.destroy
    movie_id = @comment.movie_id
    @movie = Movie.find(movie_id)
---
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 2]]
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]