app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies"
---
  def index
    @movies = Movie.all.decorate

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."movie_id" = ?  [["movie_id", 1]]
---
  def show
    @movie = Movie.find(params[:id])
    title=@movie.title
    @plot = get_plot(title)
    @rating = get_rating(title)
    @poster_url = get_poster_url(title)

    @comments = @movie.comments.all